mhv75/arduino-nRF5/boards.txt
# Copyright (c) 2014-2015 Arduino LLC.  All right reserved.
# Copyright (c) 2016 Sandeep Mistry All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

menu.chip=Chip
menu.softdevice=Softdevice
menu.version=Version
menu.lfclk=Low Frequency Clock
menu.board_variant=Board Variant


# nRF5 ATC1441 variants

###################

p22watch.name=p22watch

p22watch.upload.tool=sandeepmistry:openocd
p22watch.upload.target=nrf52
p22watch.upload.maximum_size=376800
p22watch.bootloader.tool=sandeepmistry:openocd
p22watch.build.mcu=cortex-m4
p22watch.build.f_cpu=16000000
p22watch.build.board=ATCwatch_Pinout
p22watch.build.core=nRF5
p22watch.build.variant=ATCwatch_Pinout
p22watch.build.variant_system_lib=
p22watch.build.extra_flags=-DNRF52
p22watch.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16 -DCONFIG_NFCT_PINS_AS_GPIOS -DUSE_LFRC -DNRF52 -DS132 -DNRF51_S132
p22watch.build.ldscript=armgcc_s132_nrf52832_xxaa.ld

p22watch.menu.softdevice.stockFW=Only Softdevice for Flashing via SWD
p22watch.menu.softdevice.stockFW.flashVariantFile=sd.hex
p22watch.menu.softdevice.stockFW.softdeviceversion=2.0.1
p22watch.menu.softdevice.stockFW.softdevice=S132
p22watch.menu.softdevice.onlySoftDevice=Back To Stock Firmware
p22watch.menu.softdevice.onlySoftDevice.flashVariantFile=flashP22.bin
p22watch.menu.softdevice.onlySoftDevice.softdeviceversion=2.0.1
p22watch.menu.softdevice.onlySoftDevice.softdevice=S132


###################

p8watch.name=p8watch

p8watch.upload.tool=sandeepmistry:openocd
p8watch.upload.target=nrf52
p8watch.upload.maximum_size=376800

p8watch.bootloader.tool=sandeepmistry:openocd

p8watch.build.mcu=cortex-m4
p8watch.build.f_cpu=16000000
p8watch.build.board=ATCwatch_Pinout
p8watch.build.core=nRF5
p8watch.build.variant=ATCwatch_Pinout
p8watch.build.variant_system_lib=
p8watch.build.extra_flags=-DNRF52
p8watch.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16 -DCONFIG_NFCT_PINS_AS_GPIOS -DUSE_LFRC -DNRF52 -DS132 -DNRF51_S132
p8watch.build.ldscript=armgcc_s132_nrf52832_xxaa.ld

p8watch.menu.softdevice.stockFW=Only Softdevice for Flashing via SWD
p8watch.menu.softdevice.stockFW.flashVariantFile=sd.hex
p8watch.menu.softdevice.stockFW.softdeviceversion=2.0.1
p8watch.menu.softdevice.stockFW.softdevice=S132
p8watch.menu.softdevice.onlySoftDevice=Back To Stock Firmware
p8watch.menu.softdevice.onlySoftDevice.flashVariantFile=flashP8.bin
p8watch.menu.softdevice.onlySoftDevice.softdeviceversion=2.0.1
p8watch.menu.softdevice.onlySoftDevice.softdevice=S132


###################


dsd6Watch.name=DSD6 Tracker

dsd6Watch.upload.tool=sandeepmistry:openocd
dsd6Watch.upload.target=nrf52
dsd6Watch.upload.maximum_size=376800

dsd6Watch.bootloader.tool=sandeepmistry:openocd

dsd6Watch.build.mcu=cortex-m4
dsd6Watch.build.f_cpu=16000000
dsd6Watch.build.board=DSD6
dsd6Watch.build.core=nRF5
dsd6Watch.build.variant=DSD6
dsd6Watch.build.variant_system_lib=
dsd6Watch.build.extra_flags=-DNRF52
dsd6Watch.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16 -DCONFIG_NFCT_PINS_AS_GPIOS -DUSE_LFRC -DNRF52 -DS132 -DNRF51_S132
dsd6Watch.build.ldscript=armgcc_s132_nrf52832_xxaa.ld

dsd6Watch.menu.softdevice.stockFW=Only Softdevice for Flashing via SWD
dsd6Watch.menu.softdevice.stockFW.flashVariantFile=sd.hex
dsd6Watch.menu.softdevice.stockFW.softdeviceversion=2.0.1
dsd6Watch.menu.softdevice.stockFW.softdevice=s132
dsd6Watch.menu.softdevice.onlySoftDevice=Back To Stock Firmware
dsd6Watch.menu.softdevice.onlySoftDevice.flashVariantFile=flashD6.bin
dsd6Watch.menu.softdevice.onlySoftDevice.softdeviceversion=2.0.1
dsd6Watch.menu.softdevice.onlySoftDevice.softdevice=s132

###################
nrf51bare.name=nRF51822 Bare

nrf51bare.upload.tool=sandeepmistry:openocd
nrf51bare.upload.target=nrf51
nrf51bare.upload.maximum_size=151552

nrf51bare.bootloader.tool=sandeepmistry:openocd

nrf51bare.build.mcu=cortex-m0
nrf51bare.build.f_cpu=16000000
nrf51bare.build.board=nrf51bare
nrf51bare.build.core=nRF5
nrf51bare.build.variant=nrf51bare
nrf51bare.build.variant_system_lib=
nrf51bare.build.extra_flags=-DNRF51
nrf51bare.build.float_flags=-DUSE_LFXO -DNRF51 -DS130 -DNRF51_S130
nrf51bare.build.ldscript=armgcc_s130_nrf51822_xxaa.ld

nrf51bare.menu.softdevice.stockFW=Only Softdevice for Flashing via SWD
nrf51bare.menu.softdevice.stockFW.flashVariantFile=sd51.hex
nrf51bare.menu.softdevice.stockFW.softdeviceversion=2.0.1
nrf51bare.menu.softdevice.stockFW.softdevice=S130
nrf51bare.menu.softdevice.onlySoftDevice=Back To Stock Firmware
nrf51bare.menu.softdevice.onlySoftDevice.flashVariantFile=flash51.bin
nrf51bare.menu.softdevice.onlySoftDevice.softdeviceversion=2.0.1
nrf51bare.menu.softdevice.onlySoftDevice.softdevice=S130

###########################

# nRF52832 variants
###################

Generic_nRF52832.name=Generic nRF52

Generic_nRF52832.upload.tool=sandeepmistry:openocd
Generic_nRF52832.upload.target=nrf52
Generic_nRF52832.upload.maximum_size=524288

Generic_nRF52832.bootloader.tool=sandeepmistry:openocd

Generic_nRF52832.build.mcu=cortex-m4
Generic_nRF52832.build.f_cpu=16000000
Generic_nRF52832.build.board=GENERIC
Generic_nRF52832.build.core=nRF5
Generic_nRF52832.build.variant=Generic
Generic_nRF52832.build.variant_system_lib=
Generic_nRF52832.build.extra_flags=-DNRF52
Generic_nRF52832.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
Generic_nRF52832.build.ldscript=nrf52_xxaa.ld

Generic_nRF52832.menu.softdevice.none=None
Generic_nRF52832.menu.softdevice.none.softdevice=none
Generic_nRF52832.menu.softdevice.none.softdeviceversion=

Generic_nRF52832.menu.softdevice.s132=S132
Generic_nRF52832.menu.softdevice.s132.softdevice=s132
Generic_nRF52832.menu.softdevice.s132.softdeviceversion=2.0.1
Generic_nRF52832.menu.softdevice.s132.upload.maximum_size=409600
Generic_nRF52832.menu.softdevice.s132.build.extra_flags=-DNRF52 -DS132 -DNRF51_S132
Generic_nRF52832.menu.softdevice.s132.build.ldscript=armgcc_s132_nrf52832_xxaa.ld

Generic_nRF52832.menu.lfclk.lfxo=Crystal Oscillator
Generic_nRF52832.menu.lfclk.lfxo.build.lfclk_flags=-DUSE_LFXO
Generic_nRF52832.menu.lfclk.lfrc=RC Oscillator
Generic_nRF52832.menu.lfclk.lfrc.build.lfclk_flags=-DUSE_LFRC
Generic_nRF52832.menu.lfclk.lfsynt=Synthesized
Generic_nRF52832.menu.lfclk.lfsynt.build.lfclk_flags=-DUSE_LFSYNT



bluey.name=Electronut labs bluey

bluey.upload.tool=sandeepmistry:openocd
bluey.upload.target=nrf52
bluey.upload.maximum_size=524288

bluey.bootloader.tool=sandeepmistry:openocd

bluey.build.mcu=cortex-m4
bluey.build.f_cpu=16000000
bluey.build.board=ELECTRONUT_BLUEY
bluey.build.core=nRF5
bluey.build.variant=bluey
bluey.build.variant_system_lib=
bluey.build.extra_flags=-DNRF52
bluey.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
bluey.build.ldscript=nrf52_xxaa.ld

bluey.menu.softdevice.none=None
bluey.menu.softdevice.none.softdevice=none
bluey.menu.softdevice.none.softdeviceversion=

bluey.menu.softdevice.s132=S132
bluey.menu.softdevice.s132.softdevice=s132
bluey.menu.softdevice.s132.softdeviceversion=2.0.1
bluey.menu.softdevice.s132.upload.maximum_size=409600
bluey.menu.softdevice.s132.build.extra_flags=-DNRF52 -DS132 -DNRF51_S132
bluey.menu.softdevice.s132.build.ldscript=armgcc_s132_nrf52832_xxaa.ld

bluey.menu.lfclk.lfxo=Crystal Oscillator
bluey.menu.lfclk.lfxo.build.lfclk_flags=-DUSE_LFXO
bluey.menu.lfclk.lfrc=RC Oscillator
bluey.menu.lfclk.lfrc.build.lfclk_flags=-DUSE_LFRC
bluey.menu.lfclk.lfsynt=Synthesized
bluey.menu.lfclk.lfsynt.build.lfclk_flags=-DUSE_LFSYNT



hackaBLE.name=Electronut labs hackaBLE

hackaBLE.upload.tool=sandeepmistry:openocd
hackaBLE.upload.target=nrf52
hackaBLE.upload.maximum_size=524288

hackaBLE.bootloader.tool=sandeepmistry:openocd

